ECHO OFF
CLS
TITLE Oni
set startTime=%time%
:MENU
ECHO     ██████████████████████████████████████      
ECHO   ██▒▒██    ▒▒██  ██    ░░██▓▓██    ▒▒██▓▓██
ECHO  ██▒▒  ▒▒██▒▒██    ░░██░░██▓▓  ▒▒██▒▒██▓▓  ▓▓██  
ECHO ██▒▒  ░░  ▒▒██        ░░██▓▓      ▒▒██▓▓  ▒▒  ▓▓██        .--.        _ 
ECHO ██████████████████████████████████████████████████       : ,. :      :_;
ECHO ██▒▒▒▒▒▒▒▒▒▒██        ░░██▓▓▓▓▓▓▓▓▒▒██▓▓▓▓▓▓▓▓▓▓██       : :: :,-.,-..-.
ECHO   ██▒▒  ░░▒▒██        ░░██▓▓      ▒▒██▓▓  ▒▒▓▓██         : :; :: ,. :: :
ECHO     ██▒▒  ░░▒▒██      ░░██▓▓    ▒▒██▓▓  ▒▒▓▓██            .__.':_;:_;:_;
ECHO       ██▒▒  ▒▒██      ░░██▓▓    ▒▒██▓▓  ▓▓██      
ECHO         ██▒▒  ▒▒██    ░░██▓▓  ▒▒██▓▓  ▓▓██        
ECHO           ██▒▒▒▒██    ░░██▓▓  ▒▒██▓▓▓▓██         
ECHO             ██▒▒▒▒██  ░░██▓▓▒▒██▓▓▓▓██            
ECHO              ██▒▒██  ░░██▓▓▒▒██▓▓██             
ECHO                 ██▒▒██░░██▓▓██▓▓██                
ECHO                   ████░░██▓▓████                  
ECHO                     ██░░██▓▓██                    
ECHO                       ██████ 
ECHO.
ECHO ▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀▀
ECHO Введите 1, 2 или 3 что бы выбрать что Вы хотите сделать, или 4 что бы выйти.
ECHO ▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄▄
ECHO.
ECHO 1 - Запустить Oni
ECHO 2 - Утановить библиотеки [Нужно запустить когда впервые запускаете бота]
ECHO 3 - Обновить Oni
ECHO 4 - Выйти
ECHO.
SET /P M=Введите 1, 2, 3, или 4 и нажмите ENTER:
IF %M% == 1 GOTO LAUNCH
IF %M% == 2 GOTO INSTALL
IF %M% == 3 GOTO UPDATE
IF %M% == 4 GOTO EOF
GOTO ERROR
:LAUNCH
cls
node . && GOTO MENU
:INSTALL
cls
ECHO Устанавливаем нужные библиотеки...  
ECHO [i] Если здесь Вы получаете ошибку, убедитесь, что у Вас установлена стабильная версия node.js
npm start
TIMEOUT /T 5
:UPDATE
cls
ECHO Пытаемся обновить Oni...
ECHO [i] Если здесь Вы получаете ошибку, убедитесь, что у Вас установлена стабильная версия git
git pull https://github.com/TFlashgamer/Oni-stable 
TIMEOUT /T 5
GOTO MENU
:ERROR
cls
ECHO                                            ▀▀▀▀▀▀▀▀▀▀▀▀!!!▀▀▀▀▀▀▀▀▀▀▀▀▀
ECHO                                            Вы ввели недопустимое число!
ECHO                                            ▄▄▄▄▄▄▄▄▄▄▄▄!!!▄▄▄▄▄▄▄▄▄▄▄▄▄
GOTO MENU
:EOF
cls
ECHO Закрываем Oni...
ECHO Успешно завершено
echo Бот начал работать: %startTime%
echo Бот закончил работать: %time%
TIMEOUT /T 5
exit